Revit 2016 API
Document.NewAreaLoad Method
Creates a new area load in the project.
Overload List
Name | Description
NewAreaLoad(Element, XYZ, Boolean, AreaLoadType) |  Obsolete.
Creates a new uniform hosted area load with polygonal shape within the project.
NewAreaLoad(IList<XYZ>, XYZ, Boolean, AreaLoadType) |  Obsolete.
Creates a new uniform unhosted area load with polygonal shape within the project.
NewAreaLoad(CurveArray, Int32[], Int32[], IList<XYZ>, Boolean, AreaLoadType) |  Obsolete.
Creates a new unhosted area load with variable forces at the vertices within the project.
NewAreaLoad(CurveArray, Int32[], Int32[], XYZ, XYZ, XYZ, Boolean, AreaLoadType) |  Obsolete.
Creates a new unhosted area load with variable forces at the vertices within the project.
See Also
Document Class
Document Members
Autodesk.Revit.Creation Namespace